AmbiqAI/neuralSPOT/extern/AmbiqSuite/R5.1.0_rc27/mcu/apollo510/regs/am_mcu_apollo510_otpinfo0.h
// BLRESET - This INFO0 register is required for RevB shadow loading (formerly known as SECURITY).
#define AM_REG_OTP_INFO0_BLRESET_SPINORSLEEPn_S 9
#define AM_REG_OTP_INFO0_BLRESET_SPINORSLEEPn_M 0x00000200
#define AM_REG_OTP_INFO0_BLRESET_SPINORSLEEPn(n) (((uint32_t)(n) << 9) & 0x00000200)
#define AM_REG_OTP_INFO0_BLRESET_SPINORSLEEPn_Pos 9
#define AM_REG_OTP_INFO0_BLRESET_SPINORSLEEPn_Msk 0x00000200
#define AM_ENUM_OTP_INFO0_BLRESET_SPINORSLEEPn_NORMALSLEEP      0x0  // Bootloader enters normal sleep.
#define AM_ENUM_OTP_INFO0_BLRESET_SPINORSLEEPn_SPIN             0x1  // Bootloader spins in an infinite while loop.

// RESERVED_TRIM - This is a reserved trim location. It defaults to 0x00000000 from the factory and must remain unchanged.
#define AM_REG_OTP_INFO0_RESERVED_TRIM_RSVD_TRIM_S 0
#define AM_REG_OTP_INFO0_RESERVED_TRIM_RSVD_TRIM_M 0xFFFFFFFF
#define AM_REG_OTP_INFO0_RESERVED_TRIM_RSVD_TRIM(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO0_RESERVED_TRIM_RSVD_TRIM_Pos 0
#define AM_REG_OTP_INFO0_RESERVED_TRIM_RSVD_TRIM_Msk 0xFFFFFFFF

// SECURITY_WIRED_IFC_CFG0 - This 32-bit word contains the interface configuration word0 for the UART wired update.
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_RSVD30_S 30
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_RSVD30_M 0xC0000000
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_RSVD30(n) (((uint32_t)(n) << 30) & 0xC0000000)
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_RSVD30_Pos 30
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_RSVD30_Msk 0xC0000000
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_BAUDRATE_S 8
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_BAUDRATE_M 0x3FFFFF00
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_BAUDRATE(n) (((uint32_t)(n) << 8) & 0x3FFFFF00)
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_BAUDRATE_Pos 8
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_BAUDRATE_Msk 0x3FFFFF00
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_DATALEN_S 6
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_DATALEN_M 0x000000C0
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_DATALEN(n) (((uint32_t)(n) << 6) & 0x000000C0)
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_DATALEN_Pos 6
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_DATALEN_Msk 0x000000C0
#define AM_ENUM_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_DATALEN_5BIT  0x0  // 5 bit
#define AM_ENUM_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_DATALEN_6BIT  0x1  // 6 bit
#define AM_ENUM_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_DATALEN_7BIT  0x2  // 7 bit
#define AM_ENUM_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_DATALEN_8BIT  0x3  // 8 bit
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_2STOP_S 5
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_2STOP_M 0x00000020
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_2STOP(n) (((uint32_t)(n) << 5) & 0x00000020)
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_2STOP_Pos 5
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_2STOP_Msk 0x00000020
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_EVEN_S 4
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_EVEN_M 0x00000010
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_EVEN(n) (((uint32_t)(n) << 4) & 0x00000010)
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_EVEN_Pos 4
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_EVEN_Msk 0x00000010
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_PAR_S 3
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_PAR_M 0x00000008
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_PAR(n) (((uint32_t)(n) << 3) & 0x00000008)
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_PAR_Pos 3
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_PAR_Msk 0x00000008
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_CTS_S 2
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_CTS_M 0x00000004
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_CTS(n) (((uint32_t)(n) << 2) & 0x00000004)
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_CTS_Pos 2
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_CTS_Msk 0x00000004
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_RTS_S 1
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_RTS_M 0x00000002
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_RTS(n) (((uint32_t)(n) << 1) & 0x00000002)
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_RTS_Pos 1
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_RTS_Msk 0x00000002
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_RSVD0_S 0
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_RSVD0_M 0x00000001
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_RSVD0(n) (((uint32_t)(n) << 0) & 0x00000001)
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_RSVD0_Pos 0
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG0_RSVD0_Msk 0x00000001

// SECURITY_WIRED_IFC_CFG1 - This 32-bit word contains the interface configuration word1 for the UART wired update.
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN3_S 24
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN3_M 0xFF000000
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN3(n) (((uint32_t)(n) << 24) & 0xFF000000)
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN3_Pos 24
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN3_Msk 0xFF000000
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN2_S 16
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN2_M 0x00FF0000
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN2(n) (((uint32_t)(n) << 16) & 0x00FF0000)
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN2_Pos 16
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN2_Msk 0x00FF0000
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN1_S 8
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN1_M 0x0000FF00
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN1(n) (((uint32_t)(n) << 8) & 0x0000FF00)
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN1_Pos 8
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN1_Msk 0x0000FF00
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN0_S 0
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN0_M 0x000000FF
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN0(n) (((uint32_t)(n) << 0) & 0x000000FF)
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN0_Pos 0
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG1_PIN0_Msk 0x000000FF

// SECURITY_WIRED_IFC_CFG2 - This 32-bit word contains the raw Pin configuration for the UART wired interface pin 0.
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG2_PINCFG_S 0
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG2_PINCFG_M 0xFFFFFFFF
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG2_PINCFG(n) (((uint32_t)(n) << 0) & 0xFFFFFFFF)
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG2_PINCFG_Pos 0
#define AM_REG_OTP_INFO0_SECURITY_WIRED_IFC_CFG2_PINCFG_Msk 0xFFFFFFFF

